#Использовать "../src"

Функция ФайлСуществует(Знач пИмяФайла) Экспорт
	
	файл = Новый Файл( УбратьКавычки( пИмяФайла ) );
	
	Возврат файл.Существует()
	И Не файл.ЭтоКаталог();
	
КонецФункции

Функция УбратьКавычки(Знач пСтрока)
	
	строкаБезКавычек = пСтрока;

	Если СтрНачинаетсяС(строкаБезКавычек, """") Тогда
		СтрокаБезКавычек = Сред(СтрокаБезКавычек, 2);
	КонецЕсли;

	Если СтрЗаканчиваетсяНа(строкаБезКавычек, """") Тогда
		СтрокаБезКавычек = Лев(СтрокаБезКавычек, СтрДлина(СтрокаБезКавычек) - 1);
	КонецЕсли;

	СтрокаБезКавычек = СтрЗаменить(СтрокаБезКавычек, """""", """");

	Возврат строкаБезКавычек;

КонецФункции

Процедура ПроверитьПуть( Знач пПуть, Знач пМетаданные )
	
	Если Не ЗначениеЗаполнено( пПуть ) Тогда
		
		Сообщить( СтрШаблон( "Путь для <%1> не получен", пМетаданные) );
		
	ИначеЕсли Не ФайлСуществует( пПуть ) Тогда
		
		Сообщить( СтрШаблон( "Путь <%1> для <%2> не существует", пПуть, пМетаданные) );
		
	КонецЕсли;
	
КонецПроцедуры

//генераторПутейКонфигуратора = Новый Путь1СПоМетаданным("C:\Sonar\k2\src");
генераторПутейКEDT = Новый Путь1СПоМетаданным("D:\Work\ws_erp\ERP_Управление_предприятием_2_демо\src");

ЧтениеТекста = Новый ЧтениеТекста("test\meta.txt", "UTF-8" );
примерыМета = ЧтениеТекста.Прочитать();
ЧтениеТекста.Закрыть();

Для каждого цМета Из СтрРазделить( примерыМета, Символы.ПС) Цикл

	//путьКФайлу = генераторПутейКонфигуратора.Путь( цМета );

	//ПроверитьПуть( путьКФайлу, цМета );

	путьКФайлу = генераторПутейКEDT.Путь( цМета );

	ПроверитьПуть( путьКФайлу, цМета );

КонецЦикла;