#использовать "../src"
#Использовать asserts

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьВерсиюКонфигурацииНаПолнойПоддержке");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьВерсиюКонфигурацииСНесколькимиПоддержками");
	ИменаТестов.Добавить("ТестДолжен_ПроверитьПолучениеОбъектовПоПодсистеме");
	
	Возврат ИменаТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьВерсиюКонфигурацииНаПолнойПоддержке() Экспорт
	
	данныеБазовойКонфигурации = Новый ИнформацияОКонфигурации(ИсходникиНаПолнойПоддержке());
	
	Утверждения.ПроверитьРавенство(
		данныеБазовойКонфигурации.ВерсияКонфигурации(),
		"1.2.3.4",
		"Версии конфигурации должны совпадать.");
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьВерсиюКонфигурацииСНесколькимиПоддержками() Экспорт
	
	данныеБазовойКонфигурации = Новый ИнформацияОКонфигурации(ИсходникиСНесколькимиПоддержками());
	
	Утверждения.ПроверитьРавенство(
		данныеБазовойКонфигурации.ВерсияКонфигурации(),
		"1.0.0.1",
		"Версии конфигурации должны совпадать.");
	
КонецПроцедуры

Функция ИсходникиНаПолнойПоддержке()
	
	Возврат ".\tests\src_base";
	
КонецФункции

Функция ИсходникиСНесколькимиПоддержками()
	
	Возврат ".\tests\src_lock";
	
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.app.cf_info");
Лог.УстановитьУровень(УровниЛога.Отладка);