#использовать "../src"
#Использовать asserts

Функция ПолучитьСписокТестов(Знач Тестирование) Экспорт
	
	юТест = Тестирование;
	
	ИменаТестов = Новый Массив;
	
	ИменаТестов.Добавить("ТестДолжен_ПроверитьДанныеКонфигурации");
	
	Возврат ИменаТестов;
	
КонецФункции

Процедура ТестДолжен_ПроверитьДанныеКонфигурации() Экспорт
	
	поддержка = Новый Поддержка(ИсходникиНаПолнойПоддержке());
	
	данныеПолнойПоддержки = поддержка.Данные();
	
	конфигурацияПоддержки = данныеПолнойПоддержки["Поставка1"];

	Ожидаем.Что(конфигурацияПоддержки).Не_().ЭтоНеопределено();
	
	Ожидаем.Что(конфигурацияПоддержки.РазрешеныИзменения).ЭтоЛожь();
	Ожидаем.Что(конфигурацияПоддержки.Версия).Равно("1.0.0.1");
	Ожидаем.Что(конфигурацияПоддержки.Поставщик).Равно("Поставщик, странной, конфигурации, "","", """",""""");
	Ожидаем.Что(конфигурацияПоддержки.Конфигурация).Равно("Поставка1");
	Ожидаем.Что(конфигурацияПоддержки.Объекты).ИмеетДлину(56);
	
	всеОбъекты = данныеПолнойПоддержки["ОписанияОбъектов"];

	Ожидаем.Что(всеОбъекты).ИмеетДлину(56);

	поддержка = Новый Поддержка(ИсходникиСНесколькимиПоддержками());
	
	данныеНесколькихПоддержек = поддержка.Данные();
	
	Поставка1 = данныеНесколькихПоддержек["Поставка1"];

	Ожидаем.Что(Поставка1).Не_().ЭтоНеопределено();
	
	Ожидаем.Что(Поставка1.РазрешеныИзменения).ЭтоИстина();
	Ожидаем.Что(Поставка1.Версия).Равно("1.0.0.1");
	Ожидаем.Что(Поставка1.Поставщик).Равно("Поставщик, странной, конфигурации, "","", """",""""");
	Ожидаем.Что(Поставка1.Конфигурация).Равно("Поставка1");
	Ожидаем.Что(Поставка1.Объекты).ИмеетДлину(56);

	Поставка2 = данныеНесколькихПоддержек["Поставка2"];

	Ожидаем.Что(Поставка2).Не_().ЭтоНеопределено();
	
	Ожидаем.Что(Поставка2.РазрешеныИзменения).ЭтоИстина();
	Ожидаем.Что(Поставка2.Версия).Равно("2.0.1");
	Ожидаем.Что(Поставка2.Поставщик).Равно("Поставщик поставки, для теста запятых "","", """","""", редакция ""2,0,1""");
	Ожидаем.Что(Поставка2.Конфигурация).Равно("Поставка2");
	Ожидаем.Что(Поставка2.Объекты).ИмеетДлину(8);

	Поставка3 = данныеНесколькихПоддержек["Поставка3"];

	Ожидаем.Что(Поставка3).Не_().ЭтоНеопределено();
	
	Ожидаем.Что(Поставка3.РазрешеныИзменения).ЭтоИстина();
	Ожидаем.Что(Поставка3.Версия).Равно("0.1");
	Ожидаем.Что(Поставка3.Поставщик).Равно("""Обычный Поставщик""");
	Ожидаем.Что(Поставка3.Конфигурация).Равно("Поставка3");
	Ожидаем.Что(Поставка3.Объекты).ИмеетДлину(6);
	
	всеОбъекты = данныеНесколькихПоддержек["ОписанияОбъектов"];

	Ожидаем.Что(всеОбъекты).ИмеетДлину(66);

КонецПроцедуры

Функция ИсходникиНаПолнойПоддержке()
	
	Возврат "./tests/src_lock";
	
КонецФункции

Функция ИсходникиСНесколькимиПоддержками()
	
	Возврат "./tests/src_base";
	
КонецФункции

Лог = Логирование.ПолучитьЛог("oscript.app.cf_info");
Лог.УстановитьУровень(УровниЛога.Отладка);